Python 3.8.5 (default, Jul 28 2020, 12:59:40) 
[GCC 9.3.0] on linux
Type "help", "copyright", "credits" or "license()" for more information.
>>> 
======================== RESTART: /home/azamat/4epuha.py =======================
хороший
мальчик
чихнул
Этот    на ленивую рыжую собаку.
>>> 
======================== RESTART: /home/azamat/4epuha.py =======================
хороший какой
мальчик кто
чихнул что сделал
Этот  какой  кто  что сделал на ленивую рыжую собаку.
>>> 
======================== RESTART: /home/azamat/4epuha.py =======================
какой? хороший
Кто?мальчик
Что сдалал?чихнул
Этот  хороший мальчик чихнул на ленивую рыжую собаку.
>>> 